[
  {
    "tema": "teste_software",
    "pergunta": "O que é teste de unidade?",
    "0": "Teste que verifica unidades isoladas do código, como funções ou métodos.",
    "1": "Teste que verifica a integração entre vários módulos.",
    "2": "Teste para validar se o software atende aos requisitos do cliente.",
    "3": "Teste que verifica a performance do software em alta carga."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é um teste de regressão?",
    "0": "Teste para garantir que novas alterações não causem defeitos em funcionalidades existentes.",
    "1": "Teste que verifica se o software está em conformidade com os requisitos.",
    "2": "Teste focado em avaliar a usabilidade do sistema.",
    "3": "Teste para verificar a performance do sistema sob alta carga."
  },
  {
    "tema": "teste_software",
    "pergunta": "Qual é a principal diferença entre teste de integração e teste de unidade?",
    "0": "Teste de unidade verifica funções ou métodos individuais, enquanto o teste de integração avalia a interação entre módulos.",
    "1": "Teste de unidade é feito apenas em sistemas pequenos, e o de integração em sistemas grandes.",
    "2": "Teste de unidade testa a interface com o usuário, e o de integração testa o banco de dados.",
    "3": "Não há diferença, ambos são realizados da mesma forma."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é um teste de aceitação?",
    "0": "Teste realizado para verificar se o software atende aos requisitos e expectativas do cliente.",
    "1": "Teste para verificar a segurança do sistema contra ataques externos.",
    "2": "Teste que valida a performance do sistema sob carga elevada.",
    "3": "Teste para verificar a interface gráfica do usuário."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que significa o termo 'teste de caixa preta'?",
    "0": "Teste onde o testador não tem conhecimento do código interno do sistema.",
    "1": "Teste focado apenas na análise do código fonte.",
    "2": "Teste onde o testador tem acesso completo ao código do sistema.",
    "3": "Teste que analisa apenas a documentação do sistema."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é a automação de testes?",
    "0": "Uso de ferramentas para executar testes de forma automática, sem intervenção humana.",
    "1": "Processo de testar manualmente os sistemas de software.",
    "2": "Teste que se concentra exclusivamente na performance do software.",
    "3": "Uso de métodos manuais para corrigir falhas de código."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é um bug?",
    "0": "Um defeito ou falha no software que causa um comportamento inesperado.",
    "1": "Uma funcionalidade do software que foi implementada corretamente.",
    "2": "Uma atualização do sistema para melhorar a performance.",
    "3": "A documentação do sistema que descreve o comportamento esperado."
  },
  {
    "tema": "teste_software",
    "pergunta": "Qual é o objetivo de um teste de desempenho?",
    "0": "Avaliar o comportamento do sistema sob condições de carga.",
    "1": "Verificar se o software está em conformidade com os requisitos.",
    "2": "Testar o software contra diferentes tipos de ataques.",
    "3": "Validar a interface gráfica do usuário."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é teste de segurança?",
    "0": "Teste para identificar vulnerabilidades no sistema e possíveis falhas de segurança.",
    "1": "Teste focado na verificação da usabilidade do software.",
    "2": "Teste para verificar se o sistema está em conformidade com os requisitos.",
    "3": "Teste que verifica a performance do sistema."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é teste de usabilidade?",
    "0": "Teste que avalia a facilidade de uso e a experiência do usuário.",
    "1": "Teste que verifica a integração entre módulos do sistema.",
    "2": "Teste de segurança para identificar falhas no sistema.",
    "3": "Teste de carga para verificar a performance sob alta utilização."
  },
  {
    "tema": "teste_software",
    "pergunta": "Qual das opções é um exemplo de teste de integração?",
    "0": "Testar a comunicação entre o banco de dados e o sistema.",
    "1": "Testar individualmente uma função específica do sistema.",
    "2": "Testar o software para garantir que ele atende aos requisitos.",
    "3": "Testar a interface gráfica do usuário."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é teste de compatibilidade?",
    "0": "Teste para verificar se o software funciona corretamente em diferentes dispositivos e sistemas operacionais.",
    "1": "Teste para garantir que a performance do sistema seja adequada.",
    "2": "Teste para verificar se o sistema está em conformidade com os requisitos do cliente.",
    "3": "Teste que verifica a segurança do sistema contra ataques."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é teste de carga?",
    "0": "Teste para avaliar a performance do sistema sob grande volume de usuários.",
    "1": "Teste que avalia a usabilidade do software.",
    "2": "Teste para verificar se o software atende aos requisitos do cliente.",
    "3": "Teste para verificar a segurança do sistema."
  },
  {
    "tema": "teste_software",
    "pergunta": "Qual é o objetivo do teste de stress?",
    "0": "Testar o sistema até que ele falhe para identificar o ponto de quebra.",
    "1": "Testar o desempenho do sistema sob carga normal.",
    "2": "Verificar a usabilidade e a experiência do usuário.",
    "3": "Testar a compatibilidade do sistema com outros softwares."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é teste de fumaça?",
    "0": "Teste preliminar para verificar se o software é estável o suficiente para testes mais profundos.",
    "1": "Teste para verificar a compatibilidade com outros sistemas.",
    "2": "Teste de carga para avaliar a performance do sistema.",
    "3": "Teste para garantir que o software está em conformidade com os requisitos."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é o teste de caixa branca?",
    "0": "Teste onde o testador tem acesso completo ao código-fonte do sistema.",
    "1": "Teste onde o testador não tem conhecimento do código-fonte do sistema.",
    "2": "Teste para avaliar a experiência do usuário.",
    "3": "Teste para verificar a segurança do sistema contra falhas."
  },
  {
    "tema": "teste_software",
    "pergunta": "Qual é a diferença entre testes manuais e automatizados?",
    "0": "Testes manuais são feitos por pessoas, enquanto testes automatizados utilizam ferramentas de software.",
    "1": "Testes manuais são mais rápidos, enquanto automatizados são mais lentos.",
    "2": "Testes manuais são mais confiáveis, enquanto automatizados são mais imprecisos.",
    "3": "Testes manuais verificam apenas a interface do usuário, enquanto automatizados verificam o código."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que significa 'ferramenta de teste'?",
    "0": "Software utilizado para realizar testes automaticamente em sistemas.",
    "1": "Ferramenta usada para corrigir erros no código.",
    "2": "Ferramenta para criar a documentação de requisitos.",
    "3": "Ferramenta para gerenciar equipes de desenvolvimento."
  },
  {
    "tema": "teste_software",
    "pergunta": "O que é teste de resistência?",
    "0": "Teste para avaliar o comportamento do sistema durante o uso contínuo por longos períodos.",
    "1": "Teste para verificar a segurança do sistema contra invasões.",
    "2": "Teste para validar a usabilidade do sistema.",
    "3": "Teste que verifica se o sistema atende aos requisitos de performance."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que é o conceito de Game Design?",
    "0": "Processo de criação e planejamento de jogos, incluindo regras, mecânicas e experiência do jogador.",
    "1": "Processo de desenvolvimento de gráficos e animações para jogos.",
    "2": "Estrutura de codificação usada para implementar as funcionalidades do jogo.",
    "3": "Escolha do tipo de plataforma para lançar o jogo."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "Qual das opções é uma linguagem de programação popular para o desenvolvimento de jogos?",
    "0": "C#",
    "1": "HTML",
    "2": "CSS",
    "3": "SQL"
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que são mecânicas de jogo?",
    "0": "São as regras e sistemas que definem como o jogo funciona.",
    "1": "São os gráficos e animações que tornam o jogo visualmente atraente.",
    "2": "São os sons usados para criar a atmosfera do jogo.",
    "3": "São os níveis e cenários em que o jogo ocorre."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "Qual ferramenta é comumente usada para desenvolver jogos 2D e 3D?",
    "0": "Unity",
    "1": "Excel",
    "2": "Word",
    "3": "PowerPoint"
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que significa o termo 'prototipação' no desenvolvimento de jogos?",
    "0": "Criar uma versão inicial do jogo para testar suas ideias principais.",
    "1": "Ajustar os gráficos do jogo para melhorar o design visual.",
    "2": "Fazer a codificação do código-fonte do jogo.",
    "3": "Criar música e efeitos sonoros para o jogo."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "Qual é a principal função de um motor de física em um jogo?",
    "0": "Simular o comportamento físico dos objetos dentro do jogo, como gravidade e colisões.",
    "1": "Desenhamento de gráficos e animações no jogo.",
    "2": "Reproduzir músicas e sons no jogo.",
    "3": "Gerenciar a pontuação e os dados do jogador."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que é um Level Design?",
    "0": "A criação e organização dos níveis de um jogo, incluindo o layout e os desafios.",
    "1": "A escolha das músicas e sons que serão usados no jogo.",
    "2": "A criação de personagens e inimigos do jogo.",
    "3": "A implementação de codificação para a inteligência artificial dos inimigos."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que é uma engine de jogo?",
    "0": "Uma plataforma de desenvolvimento que fornece ferramentas e funcionalidades para criar jogos.",
    "1": "Uma biblioteca de gráficos usados em jogos.",
    "2": "O hardware necessário para rodar os jogos.",
    "3": "O tipo de controle usado para jogar o jogo."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que é a animação de personagens em um jogo?",
    "0": "O processo de criar movimentos realistas e fluidos para os personagens dentro do jogo.",
    "1": "A criação dos cenários e objetos do jogo.",
    "2": "A inserção de músicas e efeitos sonoros para os personagens.",
    "3": "A codificação das regras do jogo."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "Qual é o principal objetivo de um jogo de plataforma?",
    "0": "Superar obstáculos e avançar de nível enquanto o jogador controla o personagem principal.",
    "1": "Explorar ambientes abertos e coletar itens.",
    "2": "Destruir inimigos em combates em tempo real.",
    "3": "Fazer escolhas baseadas em narrativa."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "Qual a função da Inteligência Artificial (IA) em jogos?",
    "0": "Fazer com que os personagens não jogáveis (NPCs) se comportem de forma realista e desafiadora.",
    "1": "Gerenciar as pontuações dos jogadores.",
    "2": "Desenhar os gráficos e animações do jogo.",
    "3": "Criar o áudio ambiente do jogo."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "Qual é a principal função da interface de usuário (UI) em um jogo?",
    "0": "Exibir informações importantes para o jogador, como saúde, pontuação e inventário.",
    "1": "Desenhar os mapas e cenários do jogo.",
    "2": "Gerenciar os sons e músicas durante o jogo.",
    "3": "Fazer com que os personagens se movam pelo cenário."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que significa o termo 'game loop'?",
    "0": "A sequência contínua de etapas em um jogo, como entrada do jogador, atualizações de jogo e renderização.",
    "1": "Uma forma de codificar gráficos em 2D.",
    "2": "A sequência de músicas tocadas durante o jogo.",
    "3": "A maneira como os personagens interagem uns com os outros."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que é um game designer?",
    "0": "Profissional responsável pela criação e planejamento das mecânicas e da experiência do jogo.",
    "1": "Profissional que programa as funcionalidades do jogo.",
    "2": "Profissional responsável pelos gráficos do jogo.",
    "3": "Profissional que trabalha na parte de áudio do jogo."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "Qual é a principal diferença entre jogos 2D e 3D?",
    "0": "Jogos 2D têm gráficos planos e jogos 3D têm gráficos tridimensionais.",
    "1": "Jogos 2D são mais complexos, enquanto jogos 3D são mais simples.",
    "2": "Jogos 2D utilizam controles físicos, enquanto jogos 3D utilizam controles digitais.",
    "3": "Jogos 2D são mais rápidos de criar, enquanto jogos 3D são mais lentos."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que é um jogo multiplayer?",
    "0": "Jogo que permite que mais de um jogador jogue simultaneamente.",
    "1": "Jogo que só pode ser jogado por uma pessoa.",
    "2": "Jogo em que o jogador controla vários personagens ao mesmo tempo.",
    "3": "Jogo que só possui uma fase para o jogador completar."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que é o conceito de 'feedback' em um jogo?",
    "0": "A resposta do jogo às ações do jogador, como animações, sons e efeitos.",
    "1": "A criação dos gráficos usados no jogo.",
    "2": "A codificação dos algoritmos de inteligência artificial.",
    "3": "O design das fases e desafios do jogo."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "Qual é a importância da música e dos efeitos sonoros em um jogo?",
    "0": "Eles criam a atmosfera do jogo e aumentam a imersão do jogador.",
    "1": "Eles apenas servem para adicionar elementos de distração.",
    "2": "Eles são usados para configurar os gráficos do jogo.",
    "3": "Eles são necessários para a codificação do jogo."
  },
  {
    "tema": "criacao_jogos",
    "pergunta": "O que é uma engine como Unreal Engine?",
    "0": "Uma plataforma de desenvolvimento de jogos que oferece ferramentas para criar jogos 3D e 2D.",
    "1": "Um software de edição de texto para programadores.",
    "2": "Uma ferramenta para gerenciar bancos de dados de jogos.",
    "3": "Uma plataforma para distribuir jogos online."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é um ciclo de vida de um projeto de software?",
    "0": "Fases e processos que um projeto de software passa, desde o início até o término.",
    "1": "Fases de desenvolvimento de software sem a necessidade de revisão.",
    "2": "Processos específicos para a codificação de um sistema de software.",
    "3": "Estrutura de segurança e backup de dados em um projeto de software."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é um cronograma de projeto?",
    "0": "Uma ferramenta que organiza e planeja as tarefas e prazos para a entrega do projeto.",
    "1": "A quantidade de recursos financeiros disponíveis para o projeto.",
    "2": "Um documento que descreve os requisitos técnicos do software.",
    "3": "Uma lista de todos os desenvolvedores envolvidos no projeto."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é escopo de um projeto de software?",
    "0": "Conjunto de objetivos, entregas e tarefas que devem ser realizadas durante o projeto.",
    "1": "A quantidade de código que precisa ser escrita durante o desenvolvimento.",
    "2": "A avaliação de performance do software.",
    "3": "A análise de riscos no projeto de software."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é um orçamento de projeto?",
    "0": "A estimativa dos custos necessários para concluir o projeto de software.",
    "1": "O valor pago aos desenvolvedores por hora de trabalho.",
    "2": "O tempo de execução de cada fase do projeto.",
    "3": "A qualidade do código produzido pelo time de desenvolvimento."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é uma análise de risco no gerenciamento de projetos?",
    "0": "O processo de identificar, avaliar e planejar como lidar com possíveis problemas ou falhas no projeto.",
    "1": "A avaliação do custo-benefício de cada funcionalidade do sistema.",
    "2": "A análise da estrutura organizacional do time de desenvolvimento.",
    "3": "A escolha das ferramentas de programação para o projeto."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "Qual é a principal função de um gerente de projeto?",
    "0": "Planejar, coordenar e monitorar todas as atividades do projeto para garantir que seja entregue no prazo e dentro do orçamento.",
    "1": "Codificar as funcionalidades principais do sistema de software.",
    "2": "Desenvolver a interface gráfica do usuário do sistema.",
    "3": "Testar o software para garantir que ele atenda aos requisitos."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é um marco no gerenciamento de projetos?",
    "0": "Um evento ou entrega importante que marca uma etapa significativa no progresso do projeto.",
    "1": "Uma reunião semanal para discutir o andamento do projeto.",
    "2": "Uma revisão de código realizada pela equipe.",
    "3": "A aprovação final do cliente para a entrega do projeto."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é a metodologia ágil?",
    "0": "Uma abordagem iterativa e incremental para o desenvolvimento de software, que enfatiza a flexibilidade e a colaboração.",
    "1": "Uma metodologia que segue um cronograma rígido e definirá todos os requisitos no início do projeto.",
    "2": "Uma metodologia que visa minimizar a comunicação entre as equipes de desenvolvimento e o cliente.",
    "3": "Uma técnica de desenvolvimento de software que não requer testes formais."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "Qual é a principal vantagem de usar Scrum no gerenciamento de projetos de software?",
    "0": "Permitir entregas frequentes e iterativas de pequenas partes do produto, com feedback contínuo.",
    "1": "Garantir que o projeto seja concluído no prazo e dentro do orçamento.",
    "2": "Focar apenas no desenvolvimento de código sem envolver outras áreas.",
    "3": "Reduzir o número de reuniões durante o projeto."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que significa o termo 'Kanban' no gerenciamento de projetos?",
    "0": "Uma metodologia visual para gerenciar o fluxo de trabalho e melhorar a eficiência das equipes.",
    "1": "Uma técnica de análise de dados para prever o sucesso do projeto.",
    "2": "Uma ferramenta de codificação que ajuda a desenvolver sistemas complexos.",
    "3": "Um método de avaliação do custo-benefício de cada entrega do projeto."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é uma sprint no Scrum?",
    "0": "Um período de tempo definido (geralmente 2 a 4 semanas) em que uma equipe trabalha para completar um conjunto específico de tarefas.",
    "1": "A fase em que o software é lançado ao público.",
    "2": "Uma reunião diária entre a equipe para discutir o progresso do projeto.",
    "3": "A documentação completa do projeto."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é um backlog de produto?",
    "0": "Uma lista priorizada de funcionalidades, requisitos e tarefas a serem implementadas em um projeto.",
    "1": "Um documento que descreve o processo de codificação do software.",
    "2": "Uma planilha de orçamento para o projeto.",
    "3": "Uma tabela de recursos humanos envolvidos no projeto."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é uma reunião de retrospectiva no Scrum?",
    "0": "Uma reunião onde a equipe reflete sobre o trabalho realizado e discute melhorias para o próximo ciclo.",
    "1": "Uma reunião de planejamento de sprints para definir as tarefas a serem executadas.",
    "2": "Uma reunião entre os desenvolvedores para revisar o código.",
    "3": "Uma reunião para analisar os resultados financeiros do projeto."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é uma documentação de requisitos?",
    "0": "Um documento que descreve as funcionalidades, objetivos e restrições do sistema a ser desenvolvido.",
    "1": "Um relatório sobre o andamento financeiro do projeto.",
    "2": "Uma lista de tarefas atribuídas aos desenvolvedores do projeto.",
    "3": "Um manual de instruções de como usar o sistema de software."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é a técnica de PERT (Program Evaluation and Review Technique)?",
    "0": "Uma técnica de planejamento de projetos que utiliza diagramas de rede para calcular o tempo necessário para completar tarefas.",
    "1": "Uma técnica para avaliar a performance do software durante o desenvolvimento.",
    "2": "Uma técnica para gerenciar a qualidade do código-fonte.",
    "3": "Uma técnica de otimização de recursos financeiros em projetos."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é a técnica de WBS (Work Breakdown Structure)?",
    "0": "Uma estrutura hierárquica que decompõe um projeto em tarefas menores e mais gerenciáveis.",
    "1": "Uma técnica de teste de qualidade de software.",
    "2": "Uma metodologia de avaliação de riscos em projetos de software.",
    "3": "Uma ferramenta para otimizar o desempenho do código do software."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é a análise SWOT no gerenciamento de projetos?",
    "0": "Uma técnica de planejamento estratégico que analisa forças, fraquezas, oportunidades e ameaças do projeto.",
    "1": "Uma técnica para identificar os requisitos de software do cliente.",
    "2": "Uma análise do código-fonte do projeto para otimização.",
    "3": "Uma ferramenta de gerenciamento de equipes de desenvolvedores."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é a técnica de Critical Path Method (CPM)?",
    "0": "Uma técnica de gerenciamento de projetos que identifica o caminho mais longo para concluir todas as tarefas no menor tempo possível.",
    "1": "Uma técnica para analisar a performance do software.",
    "2": "Uma ferramenta de documentação de código-fonte.",
    "3": "Uma técnica para realizar testes de integração."
  },
  {
    "tema": "gerenciamento_projetos",
    "pergunta": "O que é a gestão de mudanças em um projeto de software?",
    "0": "O processo de controlar e gerenciar mudanças nos requisitos ou no planejamento do projeto.",
    "1": "A alteração da estrutura de codificação do software.",
    "2": "O aumento do orçamento do projeto após o seu início.",
    "3": "A adição de novas funcionalidades ao produto final após o lançamento."
  }
]